--- a/doc/src/architecture/peer/_chapter.md
+++ b/doc/src/architecture/peer/_chapter.md
@@ -2,23 +2,36 @@
 
 ## PeerState
 
-```mermaid
-stateDiagram-v2
-direction LR
+```plantuml
+@startuml
+hide empty description
 
-    [*] --> Down
-    Down --> Up: connect
-    Up --> Down: disconnect
-    state Up {
-        [*] --> Available
-        Available --> Blocked: assign
-        Blocked --> Available: ready
-        state Blocked {
-            [*] --> Deploying
-            Deploying --> Member: success
-            Deploying --> [*]: failure
-            Member --> Undeploying: unassign
-            Undeploying --> [*]
-        }
-    }
+state "Down" as down
+state "Up" as up {
+  state "Failure" as failure
+  state "Available" as available
+  state "Used" as used {
+    state "Deploying" as deploying
+    state "Undeploying" as undeploying
+    state "Member" as member
+
+    [*] --> deploying
+    deploying --> member : success
+    member --> undeploying : unassign
+    deploying --> [*] : failure
+    undeploying --> [*]
+  }
+}
+
+[*] -right-> down
+down -right-> up : connect
+up -left-> down : disconnect
+
+available --> used : assign
+used --> available : ready
+
+available --> failure: error
+used --> failure : error
+
+@enduml
 ```
